Documents/ЛМ_ЭкспрессНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЛМ_ЭкспрессНакладная</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлательщикДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ВидыПлательщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехнологияДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ТехнологииДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Адреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Адреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъявленнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ОписанияГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ВидыГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поддон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Поддоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СопровождающиеДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлательщикОбратнойДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ВидыПлательщиковОбратнойДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбратнойДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ВидыОбратнойДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОбратнойДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременнойИнтервал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ВременныеИнтервалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуботняяДоставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаборДоверенности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаДеньВДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОбратнойДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическийВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбратнаяДоставкаПоддонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поддон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛМ_Поддоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШиныИДиски</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШиныДиски</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛМ_ШиныИДиски</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛМ_КонтрагентыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЛМ_КонтрагентыДоставки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрагентДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛМ_ЭкспрессНакладная/Ext/ObjectModule.bsl
Перем ОтказОтСоздания Экспорт;
Перем мЕстьОшибки Экспорт;

Процедура ВыгрузитьЭкспрессНакладную() Экспорт
	Если ПроверкаЗаполнения() Тогда
		Возврат;
	КонецЕсли;
	мЕстьОшибки = Ложь;
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("apiKey", Константы.ЛМ_КлючAPI.Получить());
	СтруктураЗапроса.Вставить("modelName", "InternetDocument");
	Если ЗначениеЗаполнено(ГУИД) Тогда
		СтруктураЗапроса.Вставить("calledMethod", "update");
	Иначе	
		СтруктураЗапроса.Вставить("calledMethod", "save");
	КонецЕсли;
	СтруктураПараметров = Новый Структура;
	Если ЗначениеЗаполнено(ГУИД) Тогда
		СтруктураПараметров.Вставить("Ref", ГУИД);
	КонецЕсли;	
	СтруктураПараметров.Вставить("PayerType", ПлательщикДоставки.ГУИД);
	СтруктураПараметров.Вставить("PaymentMethod", ФормаОплаты.ГУИД);
	СтруктураПараметров.Вставить("DateTime", Формат(ДатаОтправки, "ДФ=dd.MM.yyyy"));
	СтруктураПараметров.Вставить("ServiceType", ТехнологияДоставки.ГУИД);
	СтруктураПараметров.Вставить("Cost", Формат(ОбъявленнаяСтоимость, "ЧГ="));
	СтруктураПараметров.Вставить("CitySender", ГородОтправителя.ГУИД);
	СтруктураПараметров.Вставить("Sender", Отправитель.ГУИД);
	Если ТехнологияДоставки.ГУИД = "DoorsDoors" ИЛИ ТехнологияДоставки.ГУИД = "DoorsWarehouse" Тогда
		СтруктураПараметров.Вставить("SenderAddress", АдресОтправителя.ГУИД);
	Иначе
		СтруктураПараметров.Вставить("SenderAddress", СкладОтправителя.ГУИД);
	КонецЕсли;	
	СтруктураПараметров.Вставить("ContactSender", КонтактноеЛицоОтправителя.ГУИД);
	СтруктураПараметров.Вставить("SendersPhone", ТелефонОтправителя);
	СтруктураПараметров.Вставить("CityRecipient", ГородПолучателя.ГУИД);
	СтруктураПараметров.Вставить("Recipient", Получатель.ГУИД);
	
	Если ТехнологияДоставки.ГУИД = "DoorsDoors" ИЛИ ТехнологияДоставки.ГУИД = "WarehouseDoors" Тогда
		СтруктураПараметров.Вставить("RecipientAddress", АдресПолучателя.ГУИД);
	Иначе
		СтруктураПараметров.Вставить("RecipientAddress", СкладПолучателя.ГУИД);
	КонецЕсли;	
	СтруктураПараметров.Вставить("ContactRecipient", КонтактноеЛицоПолучателя.ГУИД);
	СтруктураПараметров.Вставить("RecipientsPhone", ТелефонПолучателя);
	
	
	Если ПараметрыГрузов.Количество() = 0 И ЗначениеЗаполнено(КоличествоМест) тогда
		СтруктураПараметров.Вставить("SeatsAmount", Формат(КоличествоМест, "ЧГ="));
	Иначе
		СтруктураПараметров.Вставить("SeatsAmount", Формат(ПараметрыГрузов.Количество(), "ЧГ="));
	КонецЕсли;
	
	СтруктураПараметров.Вставить("CargoType", ТипГруза.ГУИД);
	
	Если ПараметрыГрузов.Количество() = 0 Тогда
		Если ТипГруза.ГУИД = "Documents" Тогда
			СтруктураПараметров.Вставить("VolumeGeneral", "0");
		Иначе	
			СтруктураПараметров.Вставить("VolumeGeneral", Формат(Объем,"ЧДЦ=3"));
		КонецЕсли;	
	КонецЕсли;	
	
	СтруктураПараметров.Вставить("Weight", Формат(ФактическийВес,"ЧДЦ=1, ЧГ="));
	СтруктураПараметров.Вставить("Description", ОписаниеГруза.Наименование);
	СтруктураПараметров.Вставить("AdditionalInformation", СокрЛП(Комментарий));
	
	//Объект.ОбъемныйВес = Объект.Объем * 250;
	//Если Объект.Ширина <> 0  и Объект.Длина <> 0 И Объект.Высота <> 0 Тогда
	//	ИсходныйОбъем = Объект.Ширина * Объект.Длина * Объект.Высота;
	//	Коэфф = Объект.Объем / ИсходныйОбъем;
	//	Объект.Ширина = Объект.Ширина * Коэфф;
	//	Объект.Длина = Объект.Длина * Коэфф;
	//	Объект.Высота = Объект.Высота * Коэфф;
	//КонецЕсли;	

	
	
	МассПараметровГруза = Новый Массив;
	Для Каждого ТекСтрокаПараметровГруза Из ПараметрыГрузов Цикл
		ТекСтруктура = Новый Структура;
		Если ТипГруза.ГУИД = "Documents" Тогда
			ТекСтруктура.Вставить("volumetricWidth", "0");
			ТекСтруктура.Вставить("volumetricLength", "0");
			ТекСтруктура.Вставить("volumetricHeight", "0");
			ТекСтруктура.Вставить("volumetricVolume", "0");
		Иначе
			ТекСтруктура.Вставить("volumetricWidth", Формат(ТекСтрокаПараметровГруза.Ширина, "ЧДЦ=1; ЧРД=.; ЧГ="));
			ТекСтруктура.Вставить("volumetricLength", Формат(ТекСтрокаПараметровГруза.Длина, "ЧДЦ=1; ЧРД=.; ЧГ="));
			ТекСтруктура.Вставить("volumetricHeight", Формат(ТекСтрокаПараметровГруза.Высота, "ЧДЦ=1; ЧРД=.; ЧГ="));
			ТекСтруктура.Вставить("volumetricVolume", Формат(ТекСтрокаПараметровГруза.Объем, "ЧДЦ=6; ЧРД=.; ЧГ="));
		КонецЕсли;
		ТекСтруктура.Вставить("weight", Формат(ТекСтрокаПараметровГруза.ФактическийВес, "ЧДЦ=1; ЧРД=.; ЧГ="));
		МассПараметровГруза.Добавить(ТекСтруктура);
	КонецЦикла;	
	Если МассПараметровГруза.Количество() > 0 И ТипГруза.ГУИД <> "Documents" Тогда
		СтруктураПараметров.Вставить("OptionsSeat", МассПараметровГруза);
	КонецЕсли;
	
	МасивШиныДиски = Новый Массив;
	Если ТипГруза.ГУИД = "TiresWheels" ТОгда
		Для Каждого ТекСтр Из ШиныИДиски Цикл
			СтруктураШиныДиски = Новый Структура;
			СтруктураШиныДиски.Вставить("CargoDescription", ТекСтр.ШиныДиски.ГУИД);
			СтруктураШиныДиски.Вставить("Amount", Формат(ТекСтр.Количество, "ЧГ="));
		КонецЦикла;	
	КонецЕсли;
	
	Если МасивШиныДиски.Количество() > 0 Тогда
		СтруктураПараметров.Вставить("CargoDetails", МасивШиныДиски);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВременнойИнтервал) Тогда 
		СтруктураПараметров.Вставить("TimeInterval", ВременнойИнтервал.ГУИД);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ВидОбратнойДоставки) тогда
		МассивВидовОбратнойДоставки = Новый Массив;
		Если ВидОбратнойДоставки.ГУИД = "SignedDocuments" ИЛИ ВидОбратнойДоставки.ГУИД = "CreditDocuments" ИЛИ ВидОбратнойДоставки.ГУИД = "EWTransporter" ИЛИ ВидОбратнойДоставки.ГУИД = "Money" Тогда
			СтруктураТекВидаОбратнойДоставки = Новый Структура;
			СтруктураТекВидаОбратнойДоставки.Вставить("CargoType", ВидОбратнойДоставки.ГУИД);
			СтруктураТекВидаОбратнойДоставки.Вставить("PayerType", ПлательщикОбратнойДоставки.ГУИД);
			Если ВидОбратнойДоставки.ГУИД = "Money" Тогда
				СтруктураТекВидаОбратнойДоставки.Вставить("RedeliveryString", Формат(СуммаОбратнойДоставки, "ЧН=' '; ЧГ=0"));
			Иначе
				СтруктураТекВидаОбратнойДоставки.Вставить("RedeliveryString", ОписаниеОбратнойДоставки);
			КонецЕсли;	
			МассивВидовОбратнойДоставки.Добавить(СтруктураТекВидаОбратнойДоставки);
		КонецЕсли;	
		Если ОбратнаяДоставкаПоддонов.Количество() > 0 Тогда
			СтруктураТекВидаОбратнойДоставки = Новый Структура;
			СтруктураТекВидаОбратнойДоставки.Вставить("CargoType", "Trays");
			СтруктураТекВидаОбратнойДоставки.Вставить("PayerType", ПлательщикОбратнойДоставки.ГУИД);
			СтруктураТекВидаОбратнойДоставки.Вставить("RedeliveryString", ОписаниеОбратнойДоставки);
			МассивОбратнойДоставки = Новый Массив;
			Для каждого ТекСтрокаПоддона Из ОбратнаяДоставкаПоддонов цикл
				СтруктураПоддона = Новый Структура;
				СтруктураПоддона.Вставить("CargoDescription", ТекСтрокаПоддона.Поддон.ГУИД);
				СтруктураПоддона.Вставить("Amount", Формат(ТекСтрокаПоддона.Количество, "ЧГ="));
				МассивОбратнойДоставки.Вставить(СтруктураПоддона);
			КонецЦикла; 	
			СтруктураТекВидаОбратнойДоставки.Вставить(МассивОбратнойДоставки);
			МассивВидовОбратнойДоставки.Добавить(СтруктураТекВидаОбратнойДоставки);
		КонецЕсли;
		СтруктураПараметров.Вставить("BackwardDeliveryData", МассивВидовОбратнойДоставки);
	КонецЕсли;	
	
	Если СуботняяДоставка Тогда
		СтруктураПараметров.Вставить("SaturdayDelivery", "1");
	КонецЕсли;
	
	Если ЗаборДоверенности Тогда
		СтруктураПараметров.Вставить("IsTakeAttorney", "1");
	КонецЕсли;
	Если ДоставкаДеньВДень Тогда
		СтруктураПараметров.Вставить("SameDayDelivery", "1");
	КонецЕсли;
	Если ЗначениеЗаполнено(ЖелаемаяДатаДоставки) тогда
		СтруктураПараметров.Вставить("PreferredDeliveryDate", Формат(ЖелаемаяДатаДоставки, "ДФ=dd.MM.yyyy"));
	КонецЕсли;	
	Если ЗначениеЗаполнено(КонтрольОплаты) тогда
		СтруктураПараметров.Вставить("AfterpaymentOnGoodsCost", Формат(КонтрольОплаты, "ЧГ="));
	КонецЕсли;	
	Если ЗначениеЗаполнено(Экспедирование) тогда
		СтруктураПараметров.Вставить("ForwardingCount", Формат(Экспедирование, "ЧГ="));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерПакета) тогда
		СтруктураПараметров.Вставить("PackingNumber", НомерПакета);
	КонецЕсли;

	
	Если ЗначениеЗаполнено(Экспедирование) тогда
		СтруктураПараметров.Вставить("ForwardingCount", Формат(Экспедирование, "ЧГ="));
	КонецЕсли;

	
	СтруктураЗапроса.Вставить("methodProperties", СтруктураПараметров);
	Если Константы.ЛМ_ЯзыкИнтерфейсаОбмена.Получить() = Перечисления.ЛМ_ЯзыкиИнтерфейсаОбмена.Украинский Тогда
		СтруктураЗапроса.Вставить("language", "ua");
	Иначе
		СтруктураЗапроса.Вставить("language", "ru");
	КонецЕсли;
	ДеревоОтвета = Обработки.ЛМ_ОбменСИнформационнойСистемойСлужбыДоставки.ОтправитьЗапрос(СтруктураЗапроса);
	СтуктураОтвета = Обработки.ЛМ_ОбменСИнформационнойСистемойСлужбыДоставки.ПолучитьСтруктуруОтвета(ДеревоОтвета,Истина);
	Если Не ЗначениеЗаполнено(ГУИД) И СтуктураОтвета.Свойство("Ref") Тогда
		ГУИД = СтуктураОтвета.Ref;
	ИначеЕсли 	СтуктураОтвета.Свойство("Ошибки") Тогда
		СтруктураОшибок = СтуктураОтвета.Ошибки;
		Для Каждого КлючЗнач Из СтруктураОшибок Цикл
			Ключ = КлючЗнач.Ключ;
			ПоложениеИтератора = Найти(Ключ, "Итератор");
			Если ПоложениеИтератора > 0 Тогда
				Ключ = Лев(Ключ, ПоложениеИтератора - 1);
			КонецЕсли;
			Сообщить(Ключ + ": " + КлючЗнач.Значение, СтатусСообщения.Важное);
			мЕстьОшибки = истина;
		КонецЦикла;	
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(НомерТТН) И СтуктураОтвета.Свойство("IntDocNumber") Тогда
		НомерТТН = СтуктураОтвета.IntDocNumber;
		КонецЕсли;
КонецПроцедуры	

Функция ПроверкаЗаполнения()
	Ошибка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Отправитель) Тогда
		Сообщить("Поле ""Отправитель"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(Получатель) Тогда
		Сообщить("Поле ""Получатель"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ПлательщикДоставки) Тогда
		Сообщить("Поле ""Плательщик доставки"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ФормаОплаты) Тогда
		Сообщить("Поле ""Форма оплаты"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ТехнологияДоставки) Тогда
		Сообщить("Поле ""Технология доставки"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	
	Если ТехнологияДоставки.ГУИД = "WarehouseWarehouse" Тогда
		Если НЕ ЗначениеЗаполнено(СкладОтправителя) Тогда
			Сообщить("Поле ""Склад отправителя"" не заполнено");
			Ошибка = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СкладПолучателя) Тогда
			Сообщить("Поле ""Склад получателя"" не заполнено");
			Ошибка = Истина;
		КонецЕсли;	
	ИначеЕсли 	ТехнологияДоставки.ГУИД = "WarehouseDoors" Тогда
		Если НЕ ЗначениеЗаполнено(СкладОтправителя) Тогда
			Сообщить("Поле ""Склад отправителя"" не заполнено");
			Ошибка = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(АдресПолучателя) Тогда
			Сообщить("Поле ""Адрес получателя"" не заполнено");
			Ошибка = Истина;
		КонецЕсли;	
		
	ИначеЕсли 	ТехнологияДоставки.ГУИД = "DoorsWarehouse" Тогда
		Если НЕ ЗначениеЗаполнено(АдресОтправителя) Тогда
			Сообщить("Поле ""Адрес отправителя"" не заполнено");
			Ошибка = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СкладПолучателя) Тогда
			Сообщить("Поле ""Склад получателя"" не заполнено");
			Ошибка = Истина;
		КонецЕсли;	
	ИначеЕсли 	ТехнологияДоставки.ГУИД = "DoorsDoors" Тогда
		Если НЕ ЗначениеЗаполнено(АдресОтправителя) Тогда
			Сообщить("Поле ""Адрес отправителя"" не заполнено");
			Ошибка = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(АдресПолучателя) Тогда
			Сообщить("Поле ""Адрес получателя"" не заполнено");
			Ошибка = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	
	Если НЕ ЗначениеЗаполнено(КонтактноеЛицоОтправителя) Тогда
		Сообщить("Поле ""Контактное лицо отправителя"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(КонтактноеЛицоПолучателя) Тогда
		Сообщить("Поле ""Контактное лицо получателя"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ГородОтправителя) Тогда
		Сообщить("Поле ""Город отправителя"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ГородПолучателя) Тогда
		Сообщить("Поле ""Город получателя"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ТелефонОтправителя) Тогда
		Сообщить("Поле ""Телефон отправителя"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ТелефонПолучателя) Тогда
		Сообщить("Поле ""Телефон получателя"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ОбъявленнаяСтоимость) Тогда
		Сообщить("Поле ""Объявленная стоимость"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(КоличествоМест) Тогда
		Сообщить("Поле ""Количество мест"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ОписаниеГруза) Тогда
		Сообщить("Поле ""Описание груза"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(ТипГруза) Тогда
		Сообщить("Поле ""Тип груза"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ФактическийВес) Тогда
		Сообщить("Поле ""Фактический вес"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
    Если НЕ ЗначениеЗаполнено(ОбъемныйВес) Тогда
		Сообщить("Поле ""Объемный вес"" не заполнено");
		Ошибка = Истина;
	КонецЕсли;	
	
	Возврат Ошибка;
КонецФункции	

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения)) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЛМ_ЭкспрессНакладная.Ссылка
			|ИЗ
			|	Документ.ЛМ_ЭкспрессНакладная КАК ЛМ_ЭкспрессНакладная
			|ГДЕ
			|	ЛМ_ЭкспрессНакладная.ДокументОснование = &ДокументОснование
			|	И ЛМ_ЭкспрессНакладная.ГУИД <> """"
			|	И ЛМ_ЭкспрессНакладная.Ссылка <> &Ссылка";
			Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Если НЕ Запрос.Выполнить().Пустой() ТОгда
				Сообщить("На основании данного документа уже сформирована экспресс-накладная!");
				СтандартнаяОбработка = Ложь;
				ГУИД = "ОтказОтСоздания!!!";
				Возврат;
			КонецЕсли;	
			
			Если ДанныеЗаполнения.Метаданные().Реквизиты.Найти("Контрагент") <> Неопределено Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЛМ_КонтрагентыДоставки.КонтрагентДоставки
				|ПОМЕСТИТЬ КонтрагентДоставки
				|ИЗ
				|	РегистрСведений.ЛМ_КонтрагентыДоставки КАК ЛМ_КонтрагентыДоставки
				|ГДЕ
				|	ЛМ_КонтрагентыДоставки.Контрагент = &Контрагент
				|
				|СГРУППИРОВАТЬ ПО
				|	ЛМ_КонтрагентыДоставки.КонтрагентДоставки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЛМ_КонтактныеЛица.Фамилия,
				|	ЛМ_КонтактныеЛица.Имя,
				|	ЛМ_КонтактныеЛица.Отчество,
				|	ЛМ_КонтактныеЛица.Телефон,
				|	ЛМ_Адреса.Ссылка КАК Адрес,
				|	ЛМ_КонтактныеЛица.Ссылка КАК КонтактноеЛицо,
				|	ТаблКонтрагентДоставки.КонтрагентДоставки.Наименование КАК НаименованиеКонтрагента,
				|	ТаблКонтрагентДоставки.КонтрагентДоставки,
				|	ЕСТЬNULL(ЛМ_КонтактныеЛица.Телефон, ТаблКонтрагентДоставки.КонтрагентДоставки.Телефон) КАК Телефон,
				|	ТаблКонтрагентДоставки.КонтрагентДоставки.Город КАК Город,
				|	ТаблКонтрагентДоставки.КонтрагентДоставки.СкладПоУмолчанию КАК СкладПоУмолчанию
				|ИЗ
				|	КонтрагентДоставки КАК ТаблКонтрагентДоставки
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛМ_КонтактныеЛица КАК ЛМ_КонтактныеЛица
				|		ПО ТаблКонтрагентДоставки.КонтрагентДоставки = ЛМ_КонтактныеЛица.Владелец
				|			И (НЕ ЛМ_КонтактныеЛица.ПометкаУдаления)
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛМ_Адреса КАК ЛМ_Адреса
				|		ПО ТаблКонтрагентДоставки.КонтрагентДоставки = ЛМ_Адреса.Владелец";
				Запрос.УстановитьПараметр("Контрагент", ДанныеЗаполнения.Контрагент);
				Выборка = Запрос.Выполнить().Выбрать();
				Контрагент = ДанныеЗаполнения.Контрагент;
				Если Выборка.Следующий() Тогда
					Получатель = Выборка.КонтрагентДоставки;
					НаименованиеКонтрагента = Выборка.НаименованиеКонтрагента;
					КонтактноеЛицоПолучателя = Выборка.КонтактноеЛицо;
					АдресПолучателя = Выборка.Адрес;
					ФамилияПолучателя = Выборка.Фамилия;
					ИмяПолучателя = Выборка.Имя;
					ОтчествоПолучателя = Выборка.Отчество;
					ТелефонПолучателя = Выборка.Телефон;
					ГородПолучателя = Выборка.Город;
					Если ЗначениеЗаполнено(Выборка.СкладПоУмолчанию) Тогда
						СкладПолучателя = Выборка.СкладПоУмолчанию;
					КонецЕсли; 
				КонецЕсли;	
			КонецЕсли;
			Если ДанныеЗаполнения.Метаданные().Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
				ОбъявленнаяСтоимость = Окр(ДанныеЗаполнения.СуммаДокумента);
			КонецЕсли;	
			ДокументОснование = ДанныеЗаполнения;
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") тогда	
			ЗначениеСвойства = Неопределено;
			Если ДанныеЗаполнения.Свойство("ДокументОснование",ЗначениеСвойства) Тогда
				//Запрос = Новый Запрос;
				//Запрос.Текст = 
				//"ВЫБРАТЬ
				//|	ЛМ_ЭкспрессНакладная.Ссылка
				//|ИЗ
				//|	Документ.ЛМ_ЭкспрессНакладная КАК ЛМ_ЭкспрессНакладная
				//|ГДЕ
				//|	ЛМ_ЭкспрессНакладная.ДокументОснование = &ДокументОснование
				//|	И ЛМ_ЭкспрессНакладная.ГУИД <> """"
				//|	И ЛМ_ЭкспрессНакладная.Ссылка <> &Ссылка";
				//Запрос.УстановитьПараметр("ДокументОснование", ЗначениеСвойства);
				//Запрос.УстановитьПараметр("Ссылка", Ссылка);
				//Если НЕ Запрос.Выполнить().Пустой() ТОгда
				//	Сообщить("На основании данного документа уже сформирована экспресс-накладная!");
				//	СтандартнаяОбработка = Ложь;
				//	ГУИД = "ОтказОтСоздания!!!";
				//	Возврат;
				//КонецЕсли;
				ДокументОснование = ЗначениеСвойства;
				Контрагент = ЗначениеСвойства.Контрагент;
			КонецЕсли;	
			
			ЗначениеСвойства = Неопределено;
			Если ДанныеЗаполнения.Свойство("КонтрагентДоставки", ЗначениеСвойства) Тогда
				Получатель = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("НаименованиеКонтрагента", ЗначениеСвойства) Тогда
				НаименованиеКонтрагента = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("КонтактноеЛицоПолучателя", ЗначениеСвойства) Тогда
				КонтактноеЛицоПолучателя = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ФамилияПолучателя", ЗначениеСвойства) Тогда
				ФамилияПолучателя = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ИмяПолучателя", ЗначениеСвойства) Тогда
				ИмяПолучателя = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ОтчествоПолучателя", ЗначениеСвойства) Тогда
				ОтчествоПолучателя = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ТелефонПолучателя", ЗначениеСвойства) Тогда
				ТелефонПолучателя = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ГородПолучателя", ЗначениеСвойства) Тогда
				ГородПолучателя = ЗначениеСвойства;
			КонецЕсли;
			
			Если ДанныеЗаполнения.Свойство("Комментарий", ЗначениеСвойства) Тогда
				Комментарий = ЗначениеСвойства;
			КонецЕсли;
			
			Если ДанныеЗаполнения.Свойство("НомерПакета", ЗначениеСвойства) Тогда
				НомерПакета = ЗначениеСвойства;
			КонецЕсли;

			Если ДанныеЗаполнения.Свойство("АдресПолучателя", ЗначениеСвойства) Тогда
				АдресПолучателя = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ТехнологияДоставки", ЗначениеСвойства) Тогда
				ТехнологияДоставки = ЗначениеСвойства;
			КонецЕсли;
			
			Если ДанныеЗаполнения.Свойство("СкладПолучателя", ЗначениеСвойства) Тогда
				СкладПолучателя = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("Вес", ЗначениеСвойства) Тогда
				ФактическийВес = ЗначениеСвойства;
				ОбъемныйВес = ФактическийВес;
				Объем = ОбъемныйВес / 250;
 			КонецЕсли;
			
			Если ДанныеЗаполнения.Свойство("КоличествоМест", ЗначениеСвойства) Тогда
				КоличествоМест = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ДатаОтправки", ЗначениеСвойства) Тогда
				ДатаОтправки = ЗначениеСвойства;
			КонецЕсли;
			
			
			Если ДанныеЗаполнения.Свойство("Отправитель", ЗначениеСвойства) Тогда
				Отправитель = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("КонтактноеЛицоОтправителя", ЗначениеСвойства) Тогда
				КонтактноеЛицоОтправителя = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("СкладОтправителя", ЗначениеСвойства) Тогда
				СкладОтправителя = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ФормаОплаты", ЗначениеСвойства) Тогда
				ФормаОплаты = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ПлательщикДоставки", ЗначениеСвойства) Тогда
				ПлательщикДоставки = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ВидОбратнойДоставки", ЗначениеСвойства) Тогда
				ВидОбратнойДоставки = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ПлательщикОбратнойДоставки", ЗначениеСвойства) Тогда
				ПлательщикОбратнойДоставки = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ОбъявленнаяСтоимость", ЗначениеСвойства) Тогда
				ОбъявленнаяСтоимость = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("СуммаОбратнойДоставки", ЗначениеСвойства) Тогда
				СуммаОбратнойДоставки = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("СуботняяДоставка", ЗначениеСвойства) Тогда
				СуботняяДоставка = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("КонтрольОплаты", ЗначениеСвойства) Тогда
				КонтрольОплаты = ЗначениеСвойства;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ВидГруза", ЗначениеСвойства) Тогда
				ТипГруза = ЗначениеСвойства;
			КонецЕсли;
			
			Если ДанныеЗаполнения.Свойство("ОписаниеГруза") И ЗначениеЗаполнено(ДанныеЗаполнения.ОписаниеГруза) Тогда
				ОписаниеГруза = ДанныеЗаполнения.ОписаниеГруза;
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(ДокументОснование) Тогда
				КоличествоМест = ДокументОснование.Мест;
				Если ЗначениеЗаполнено(ДокументОснование.Вес) тогда
					ФактическийВес = ДокументОснование.Вес;//КоличествоМест;
				Иначе
					ФактическийВес = 0;
					Для Каждого ТекСтр Из ДокументОснование.Товары Цикл
						Если ТекСтр.Номенклатура.Вес<>0 тогда
							ФактическийВес = ФактическийВес + ТекСтр.Номенклатура.Вес * ТекСТр.Количество;
						Иначе
							ФактическийВес = ФактическийВес + ТекСтр.Номенклатура.ВидНоменклатуры.Вес * ТекСТр.Количество;
						КонецЕсли;	
					КонецЦикла;	
					ФактическийВес = ФактическийВес;//КоличествоМест;
				КонецЕсли;	
				
				Если ЗначениеЗаполнено(ДокументОснование.ОбъемныйВес) тогда
					ОбъемныйВес = ДокументОснование.ОбъемныйВес;//КоличествоМест;
					Объем = ОбъемныйВес / 250;
				Иначе
					ОбъемныйВес = ФактическийВес;
					Объем = ОбъемныйВес / 250;
				КонецЕсли;	
			КонецЕсли;	
			//Если Найти(НРег(СкладПолучателя.Наименование), "поштомат") > 0 Тогда
				Если ЗначениеЗаполнено(ДокументОснование.Ширина) И ЗначениеЗаполнено(ДокументОснование.Длина) И ЗначениеЗаполнено(ДокументОснование.Высота) Тогда
					Для хх = 1 По КоличествоМест Цикл
						СТр = ПараметрыГрузов.Добавить();
						СТр.Высота = ДокументОснование.Высота;
						СТр.Ширина = ДокументОснование.Ширина;
						СТр.Длина = ДокументОснование.Длина;
						СТр.Объем = Объем / КоличествоМест;
						Стр.ФактическийВес = ФактическийВес ;// КоличествоМест;
					КонецЦикла;	
				Иначе
					СуммарныйОбъем = 0;
					Для Каждого ТекСТрока Из ДокументОснование.Товары Цикл
						Если ЗначениеЗаполнено(ТекСТрока.Высота) 
							И ЗначениеЗаполнено(ТекСТрока.Ширина) 
							И ЗначениеЗаполнено(ТекСТрока.Длина) Тогда
							Стр = ПараметрыГрузов.Добавить();
							Стр.Высота = ТекСТрока.Высота;
							Стр.Ширина = ТекСТрока.Ширина;
							Стр.Длина = ТекСТрока.Длина;
							Стр.Объем = Стр.Длина * Стр.Ширина * Стр.Высота / 1000000;
							СуммарныйОбъем = СуммарныйОбъем + Стр.Длина * Стр.Ширина * Стр.Высота * ТекСТрока.Количество / 1000000;
							Если ЗначениеЗаполнено(ТекСТрока.Вес) Тогда
								Стр.ФактическийВес = ТекСТрока.Вес;
							Иначе	
								Стр.ФактическийВес = ТекСТрока.Количество * ТекСТрока.ЕдиницаИзмерения.Вес;
							КонецЕсли;	
						Иначеесли ЗначениеЗаполнено(ТекСТрока.Номенклатура.ВидНоменклатуры.Высота) 
							И ЗначениеЗаполнено(ТекСТрока.Номенклатура.ВидНоменклатуры.Ширина) 
							И ЗначениеЗаполнено(ТекСТрока.Номенклатура.ВидНоменклатуры.Длина) Тогда
							Стр = ПараметрыГрузов.Добавить();
							Стр.Высота = ТекСТрока.Номенклатура.ВидНоменклатуры.Высота;
							Стр.Ширина = ТекСТрока.Номенклатура.ВидНоменклатуры.Ширина;
							Стр.Длина = ТекСТрока.Номенклатура.ВидНоменклатуры.Длина;
							Стр.Объем = Стр.Длина * Стр.Ширина * Стр.Высота / 1000000;
							СуммарныйОбъем = СуммарныйОбъем + Стр.Длина * Стр.Ширина * Стр.Высота * ТекСТрока.Количество / 1000000;
							Если ЗначениеЗаполнено(ТекСТрока.Вес) Тогда
								Стр.ФактическийВес = ТекСТрока.Вес;
							Иначе	
								Стр.ФактическийВес = ТекСТрока.Количество * ТекСТрока.ЕдиницаИзмерения.Вес;
							КонецЕсли;	
						Иначе
						//	Сообщить("Не указаны размеры посылки для вида номенклатуры " + ТекСТрока.Номенклатура);
						КонецЕсли;	
					КонецЦикла;

				КонецЕсли;
			//КонецЕсли;	
			
			//КоличествоМест = 1;
			//СуммарныйОбъем = 0;
			//Для Каждого ТекСТрока Из ДокументОснование.Товары Цикл
			//	Если ЗначениеЗаполнено(ТекСТрока.Высота) 
			//		И ЗначениеЗаполнено(ТекСТрока.Ширина) 
			//		И ЗначениеЗаполнено(ТекСТрока.Длина) Тогда
			//		Стр = ПараметрыГрузов.Добавить();
			//		Стр.Высота = ТекСТрока.Высота;
			//		Стр.Ширина = ТекСТрока.Ширина;
			//		Стр.Длина = ТекСТрока.Длина;
			//		Стр.Объем = Стр.Длина * Стр.Ширина * Стр.Высота / 1000000;
			//		СуммарныйОбъем = СуммарныйОбъем + Стр.Длина * Стр.Ширина * Стр.Высота * ТекСТрока.Количество / 1000000;
			//		Если ЗначениеЗаполнено(ТекСТрока.Вес) Тогда
			//			Стр.ФактическийВес = ТекСТрока.Вес;
			//		Иначе	
			//			Стр.ФактическийВес = ТекСТрока.Количество * ТекСТрока.ЕдиницаИзмерения.Вес;
			//		КонецЕсли;	
			//	Иначеесли ЗначениеЗаполнено(ТекСТрока.Номенклатура.ВидНоменклатуры.Высота) 
			//		И ЗначениеЗаполнено(ТекСТрока.Номенклатура.ВидНоменклатуры.Ширина) 
			//		И ЗначениеЗаполнено(ТекСТрока.Номенклатура.ВидНоменклатуры.Длина) Тогда
			//		Стр = ПараметрыГрузов.Добавить();
			//		Стр.Высота = ТекСТрока.Номенклатура.ВидНоменклатуры.Высота;
			//		Стр.Ширина = ТекСТрока.Номенклатура.ВидНоменклатуры.Ширина;
			//		Стр.Длина = ТекСТрока.Номенклатура.ВидНоменклатуры.Длина;
			//		Стр.Объем = Стр.Длина * Стр.Ширина * Стр.Высота / 1000000;
			//		СуммарныйОбъем = СуммарныйОбъем + Стр.Длина * Стр.Ширина * Стр.Высота * ТекСТрока.Количество / 1000000;
			//		Если ЗначениеЗаполнено(ТекСТрока.Вес) Тогда
			//			Стр.ФактическийВес = ТекСТрока.Вес;
			//		Иначе	
			//			Стр.ФактическийВес = ТекСТрока.Количество * ТекСТрока.ЕдиницаИзмерения.Вес;
			//		КонецЕсли;	
			//	Иначе
			//		Сообщить("Не указаны размеры посылки для вида номенклатуры " + ТекСТрока.Номенклатура);
			//	КонецЕсли;	
			//КонецЦикла;
			//Если ПараметрыГрузов.Количество() > 0 Тогда
			//	ВысотаОднойСтроки = 1;
			//	ШиринаОднойСтроки = 1;
			//	ДлинаОднойСтроки = 1;
			//	ОбъемОднойСтроки = 1 / 1000000;
			//	Для каждого Стр Из ПараметрыГрузов Цикл
			//		Если ЗначениеЗаполнено(Стр.Высота) И ЗначениеЗаполнено(Стр.Ширина) И ЗначениеЗаполнено(Стр.Длина) Тогда
			//			ВысотаОднойСтроки = Стр.Высота;
			//			ШиринаОднойСтроки = Стр.Ширина;
			//			ДлинаОднойСтроки = Стр.Длина;
			//			ОбъемОднойСтроки = Стр.Объем;
			//			Прервать;
			//		КонецЕсли;	
			//	КонецЦикла;	
			//	//СуммарныйОбъем = ПараметрыГрузов.Итог("Объем");
			//	Коэфф = Pow(СуммарныйОбъем / ОбъемОднойСтроки, (1/3));
			//	ВысотаОднойСтроки = ВысотаОднойСтроки * Коэфф;
			//	ШиринаОднойСтроки = ШиринаОднойСтроки * Коэфф;
			//	ДлинаОднойСтроки = ДлинаОднойСтроки * Коэфф;
			//	ФактическийВесОднойСтроки = ПараметрыГрузов.Итог("ФактическийВес");
			//	ПараметрыГрузов.Очистить();
			//	СтрТЧ = ПараметрыГрузов.Добавить();
			//	СтрТЧ.Высота = ВысотаОднойСтроки;
			//	СтрТЧ.Ширина = ШиринаОднойСтроки;
			//	СтрТЧ.Длина = ДлинаОднойСтроки;
			//	СтрТЧ.ФактическийВес = ФактическийВесОднойСтроки;
			//	СтрТЧ.Объем = СуммарныйОбъем;
			//КонецЕсли;	
			//
			//ФактическийВес = ПараметрыГрузов.Итог("ФактическийВес");
			//ОбъемныйВес = ФактическийВес;
			//Объем = ПараметрыГрузов.Итог("Объем");
			//ОбъемныйВес = Объем * 250;
			
			
		КонецЕсли;
	КонецЕсли;
	
	СтруктураНастройки = Константы.ЛМ_НастройкиЗаполненияЭкспрессНакладнойПоУмолчанию.Получить().Получить();
	Если ТипЗнч(СтруктураНастройки) = Тип("Структура") Тогда
		Если СтруктураНастройки.Свойство("Отправитель") Тогда
			Если не ЗначениеЗаполнено(Отправитель) тогда
				Отправитель = СтруктураНастройки.Отправитель;
			КонецЕсли;
			Если не ЗначениеЗаполнено(ГородОтправителя) Тогда
				ГородОтправителя = Отправитель.Город;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ТелефонОтправителя) тогда
				ТелефонОтправителя = Отправитель.Телефон;
			КонецЕсли;
		КонецЕсли;	
		Если СтруктураНастройки.Свойство("КонтактноеЛицоОтправителя") Тогда
			Если Не ЗначениеЗаполнено(КонтактноеЛицоОтправителя) тогда
				КонтактноеЛицоОтправителя = СтруктураНастройки.КонтактноеЛицоОтправителя;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ТелефонОтправителя) тогда
				ТелефонОтправителя = КонтактноеЛицоОтправителя.Телефон;
			КонецЕсли;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СкладОтправителя) И СтруктураНастройки.Свойство("СкладОтправителя") Тогда
			СкладОтправителя = СтруктураНастройки.СкладОтправителя;
		КонецЕсли;	
		
		Если (не ЗначениеЗаполнено(ГородОтправителя)) и (ЗначениеЗаполнено(СкладОтправителя)) Тогда
			ГородОтправителя = СкладОтправителя.Владелец;
		КонецЕсли;
		
		Если СтруктураНастройки.Свойство("АдресОтправителя") Тогда
			АдресОтправителя = СтруктураНастройки.АдресОтправителя;
		КонецЕсли;	
		если Не ЗначениеЗаполнено(ТехнологияДоставки) Тогда
			Если СтруктураНастройки.Свойство("ТехнологияДоставки") Тогда
				ТехнологияДоставки = СтруктураНастройки.ТехнологияДоставки;
			КонецЕсли;	
		КонецЕсли;	
		Если СтруктураНастройки.Свойство("ТипГруза") И Не ЗначениеЗаполнено(ТипГруза) Тогда
			ТипГруза = СтруктураНастройки.ТипГруза;
		КонецЕсли;	
		Если СтруктураНастройки.Свойство("ОписаниеГруза") И НЕ ЗначениеЗаполнено(ОписаниеГруза) Тогда
			ОписаниеГруза = СтруктураНастройки.ОписаниеГруза;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ФормаОплаты) И СтруктураНастройки.Свойство("ФормаОплаты") Тогда
			ФормаОплаты = СтруктураНастройки.ФормаОплаты;
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ПлательщикДоставки) И СтруктураНастройки.Свойство("ПлательщикДоставки") Тогда
			ПлательщикДоставки = СтруктураНастройки.ПлательщикДоставки;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ВидОбратнойДоставки) И  СтруктураНастройки.Свойство("ВидОбратнойДоставки") Тогда
			ВидОбратнойДоставки = СтруктураНастройки.ВидОбратнойДоставки;
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ПлательщикОбратнойДоставки) И СтруктураНастройки.Свойство("ПлательщикОбратнойДоставки") Тогда
			ПлательщикОбратнойДоставки = СтруктураНастройки.ПлательщикОбратнойДоставки;
		КонецЕсли;	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КоличествоМест) Тогда
		КоличествоМест = 1;
	КонецЕсли;
	
КонецПроцедуры

Функция Печать(ИмяПечФормы) Экспорт
	
	//ХТТПСоединение = Новый HTTPСоединение("my.novaposhta.ua",,,,,Истина);
	//ФайлОтвета = ПолучитьИмяВременногоФайла("html");
	//Если ИмяПечФормы = "Маркировка" Тогда
	//	ХТТПЗапрос = Новый HTTPЗапрос("/orders/printMarkings/orders[]/" + ГУИД + "/type/html/apiKey/" + Константы.ЛМ_КлючAPI.Получить());
	//Иначе	
	//	ХТТПЗапрос = Новый HTTPЗапрос("/orders/printDocument/orders[]/" + ГУИД + "/type/html/apiKey/" + Константы.ЛМ_КлючAPI.Получить());
	//КонецЕсли;
	//Ответ = ХТТПСоединение.Получить(ХТТПЗапрос, ФайлОтвета);
	//Если Ответ.КодСостояния = 200 Тогда
	//	Чтение = Новый ЧтениеТекста(ФайлОтвета, КодировкаТекста.UTF8);
	//	СтрокаРезультат = Чтение.Прочитать();
	//	Если ЗначениеЗаполнено(СтрокаРезультат) Тогда
	//		Возврат СтрокаРезультат;
	//	КонецЕсли;	
	//КонецЕсли;	
	
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("apiKey", Константы.ЛМ_КлючAPI.Получить());
	СтруктураЗапроса.Вставить("modelName", "InternetDocument");
	Если ИмяПечФормы = "Маркировка" Тогда
		СтруктураЗапроса.Вставить("calledMethod", "printMarkings");
	ИначеЕсли ИмяПечФормы = "ЭН" Тогда
		СтруктураЗапроса.Вставить("calledMethod", "printDocument");
	КонецЕсли;
	
	СтруктураСсылок = Новый Структура;
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(ГУИД);
	СтруктураСсылок.Вставить("DocumentRefs", Новый Структура("item", ГУИД));
	СтруктураСсылок.Вставить("Type", "Html");
	
	СтруктураЗапроса.Вставить("methodProperties", СтруктураСсылок);
	ДеревоОтвета = Обработки.ЛМ_ОбменСИнформационнойСистемойСлужбыДоставки.ОтправитьЗапрос(СтруктураЗапроса);
	СтуктураОтвета = Обработки.ЛМ_ОбменСИнформационнойСистемойСлужбыДоставки.ПолучитьСтруктуруОтвета(ДеревоОтвета);
	Если СтуктураОтвета.Свойство("success") Тогда
		Если СтуктураОтвета.success = "true" Тогда
	 		Распечатан = Истина;
			Записать();
			Возврат "";
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДокументОснование) И Распечатан И НЕ ДокументОснование.Распечатан Тогда
		
	КонецЕсли;	
	//		
КонецФункции

Процедура УдалитьДокумент() Экспорт
	Если Распечатан Тогда
		Сообщить("Документ распечатан. Удаление документа невозможно!");
	КонецЕсли;	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("apiKey", Константы.ЛМ_КлючAPI.Получить());
	СтруктураЗапроса.Вставить("modelName", "InternetDocument");
	СтруктураЗапроса.Вставить("calledMethod", "delete");
	СтруктураЗапроса.Вставить("methodProperties", Новый Структура("DocumentRefs", Новый Структура("item" ,ГУИД)));
	ДеревоОтвета = Обработки.ЛМ_ОбменСИнформационнойСистемойСлужбыДоставки.ОтправитьЗапрос(СтруктураЗапроса);
	СтуктураОтвета = Обработки.ЛМ_ОбменСИнформационнойСистемойСлужбыДоставки.ПолучитьСтруктуруОтвета(ДеревоОтвета);
	Если СтуктураОтвета.Свойство("success") Тогда
		Если СтуктураОтвета.success = "true" Тогда
			ПометкаУдаления = Истина;
			Записать();
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЗначениеЗаполнено(ДатаОтправки) тогда
		ДатаОтправки = Дата;
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ГУИД = "";
КонецПроцедуры
